brew 'caskroom/cask/brew-cask'
brew 'cask'

# Taps
tap 'caskroom/cask'
tap 'git-comment/formulae'
tap 'homebrew/bundle'
tap 'querykit/formulae'

# Desktop
cask 'airserver'
cask 'alfred'
cask 'amethyst'
cask 'bartender'
cask 'calibre'
cask 'cleanmymac2'
cask 'disk-inventory-x'
cask 'dnscrypt'
cask 'firefox'
cask 'iterm2-beta'
cask 'karabiner'
cask 'keycastr'
cask 'mou'
cask 'musescore'
cask 'owncloud'
cask 'seil'
cask 'send-to-kindle'
cask 'silverlight'
cask 'sketch'
cask 'techstoreclub-simple-comic'
cask 'the-unarchiver'
cask 'time-out'
cask 'transmission'
cask 'vlc'
cask 'wineskin-winery'

# Chat
cask 'telegram'
brew 'weechat', args: ['with-python', 'with-perl']

# Keyboard Config
brew 'dfu-util'

# Games
tap 'homebrew/games'
brew 'cmatrix'
brew 'homebrew/games/mednafen'
brew 'homebrew/games/nethack'
brew 'homebrew/games/nudoku'
brew 'homebrew/games/vitetris'
brew 'homebrew/games/tty-solitaire'
brew 'pipes-sh'
brew 'wine'
brew 'winetricks'
brew 'kattrali/formulae/thyme'
brew 'itchyny/maze/maze'
cask 'controllermate'
cask 'dosbox'
cask 'openemu'
cask 'steam'
cask 'stepmania'

# Music
brew 'ncmpcpp', args: ['with-visualizer']
brew 'pianobar'
brew 'cmus'

# Mail
brew 'abook'
brew 'getmail'
brew 'mutt'
brew 'notmuch'

# Shells
brew 'fish'
brew 'bash'

# Development
cask 'rowanj-gitx'
cask 'alcatraz'
cask 'xscope'
brew 'autoconf'
brew 'automake'
brew 'chruby'
brew 'chruby-fish'
brew 'class-dump'
brew 'cloc'
brew 'cmake'
brew 'doxygen'
brew 'git'
brew 'gnupg'
brew 'go'
brew 'jsonpp'
brew 'kylef/formulae/swiftenv'
brew 'libgit2'
brew 'lua'
brew 'mercurial'
brew 'node'
brew 'openssl', args: ['universal']
brew 'progress'
brew 'python'
brew 'redis'
brew 'rust'
brew 'screenfetch'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tig'
brew 'vim'
brew 'vimpager'

# Game Dev
cask 'tiled'
cask 'love'
brew 'luajit'

# Utilities
brew 'aspell'
brew 'curl'
brew 'dtrx'
brew 'fzf', args: ['HEAD']
brew 'gettext'
brew 'htop'
## tmux 2.0
brew 'https://raw.githubusercontent.com/Homebrew/homebrew/38d1b97f531147235cd2528de4e87286fd45cc16/Library/Formula/tmux.rb'
brew 'jrnl'
brew 'khal'
brew 'ledger'
brew 'lynx'
brew 'mackup'
brew 'newsbeuter'
brew 'pass'
brew 'pcre'
brew 'pkg-config'
brew 'ranger'
brew 'readline'
brew 'redshift'
brew 'todo-txt'
brew 'trash'
brew 'tree'
brew 'urlview'
brew 'utimer'
brew 'wget'
brew 'wifi-password'
brew 'zzz'
cask 'qlmarkdown'
cask 'virtualbox'
