tap 'caskroom/cask'
brew 'cask'

# Taps
tap 'git-comment/formulae'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'querykit/formulae'

# Desktop
cask 'caskroom/versions/alfred2'
cask '1password'
cask 'amethyst'
cask 'bear'
cask 'calibre'
cask 'disk-inventory-x'
cask 'dnscrypt'
cask 'iterm2'
cask 'monodraw'
cask 'mou'
cask 'musescore'
cask 'seafile-client'
cask 'seil'
cask 'send-to-kindle'
cask 'silverlight'
cask 'sketch'
cask 'techstoreclub-simple-comic'
cask 'the-unarchiver'
cask 'time-out'
cask 'transmission'
cask 'vlc'
mas 'Deckset', id: 847496013

# Chat
cask 'telegram'
brew 'weechat', args: ['with-python', 'with-perl']

# Keyboard Config
brew 'dfu-util'

# Games
tap 'homebrew/games'
tap 'kattrali/formulae'
tap 'itchyny/maze'
brew 'cmatrix'
brew 'homebrew/games/mednafen'
brew 'homebrew/games/nethack'
brew 'homebrew/games/nudoku'
brew 'homebrew/games/vitetris'
brew 'homebrew/games/tty-solitaire'
cask 'xquartz'
brew 'wine'
brew 'winetricks'
cask 'wineskin-winery'
brew 'thyme'
brew 'maze'
cask 'adventure'
cask 'dosbox'
cask 'mari0'
cask 'openemu'
cask 'itch'

# Music
brew 'ncmpcpp', args: ['with-visualizer']
brew 'pianobar'
brew 'cmus'

# Mail
brew 'abook'
brew 'alot'
brew 'getmail'
brew 'mutt'
brew 'notmuch'

# Shells
brew 'fish'
brew 'bash'

# Development
tap 'kylef/formulae'
brew 'swiftenv'
brew 'clang-format'
brew 'ctags'
cask 'rowanj-gitx'
brew 'autoconf'
brew 'automake'
brew 'chruby'
brew 'chruby-fish'
brew 'cloc'
brew 'cmake'
brew 'doxygen'
brew 'entr'
brew 'git'
brew 'gnupg2'
brew 'go'
brew 'jsonpp'
brew 'libgit2'
brew 'lua'
brew 'multirust'
brew 'openssl', args: ['universal']
brew 'progress'
brew 'python'
brew 'redis'
brew 'screenfetch'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tig'
brew 'vim'
brew 'vimpager'

# Game Dev
brew 'haxe'
brew 'love'
brew 'sdl2'
brew 'sdl2_image'
cask 'aseprite'
cask 'bfxr'
cask 'magicavoxel'
cask 'sunvox'
cask 'tiled'
mas 'Pixen', id: 525180431

# Utilities
brew 'aspell'
brew 'buku'
brew 'curl'
brew 'dtrx'
brew 'duplicity'
brew 'fzf'
brew 'gettext'
brew 'htop'
brew 'jrnl'
brew 'jq'
brew 'khal'
brew 'ledger'
brew 'lynx'
brew 'mackup'
brew 'newsbeuter'
brew 'pass'
brew 'pkg-config'
brew 'ranger'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redshift'
brew 'tmux'
brew 'todo-txt'
brew 'trash'
brew 'tree'
brew 'urlview'
brew 'utimer'
brew 'wget'
brew 'wifi-password'
brew 'zzz'
cask 'qlmarkdown'
cask 'virtualbox'
mas 'Sip', id: 507257563
